using System.Reflection;

int n, result = 0;


Console.WriteLine("Задай цiле число Х");
int x = Convert.ToInt32(Console.ReadLine());

//не виходить зробити так, щоб при введенні, наприклад, букви - програма писала помилку . В випадку, що нижче, при введенні букви - виліт
//з цілими числами виходить нормально, використав оператор залишку при діленні, який буде = 0, якщо число ціле 
//це призводить до помилки при введенні нуля ( 0/0 = біда ) 
if (x % x == 0)
    Console.WriteLine($"Ти задав Х = " + x);
else 
    Console.WriteLine($"Ти задав неправильне значення Х");

 
Console.WriteLine("Задай число Y");
var y = Convert.ToInt32(Console.ReadLine());
if (y % y == 0)
    Console.WriteLine($"Ти задав Y = " + y);
else
    Console.WriteLine($"Ти задав неправильне значення Y");


Console.WriteLine($"Сума цiлих чисел в дiапазонi мiж " + x + " та " + y + " становить: ");

//задаю умову перевірки яке з чисел більше, оскільки це безпосередньо впливає на результат

if (x >= y)

 
{
    for (n = y; x >= n; n++)
        result = result + n;
    Console.WriteLine(result);
}

//змінна n, яка на початку = у, в циклі буде рости на +1 від введеного меншого числа, поки менше і більше числа не зрівняються.
//кінцева result буде = n + n+1 + (n+1)+1 + ((n+1)+1)+1 ... і так, поки n+1 не буде = більшому із введених чисел...
 

else if (y >= x)  // чи можна тут просто написати else ? Я пробував і так, і так. На результат, здається, не впливає
{
    for (n = x; y >= n; n++)
        result = result + n; 

    Console.WriteLine(result);
}

Console.ReadLine();



